test_result/fio-3.28-4R5J0001-sw-1G-qd256-num1-16K-3000-WT.txt
fio-3.28-4R5J0001-write-1G-256-1-16K: (g=0): rw=write, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=256
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685933,
  "timestamp_ms" : 1750685933532,
  "time" : "Mon Jun 23 21:38:53 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-write-1G-256-1-16K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-write-1G-256-1-16K",
        "filename" : "/dev/sda",
        "rw" : "write",
        "bs" : "16K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "256",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1012009259,
        "bw" : 988290,
        "iops" : 61768.143261,
        "runtime" : 1061,
        "total_ios" : 65536,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 2817,
          "max" : 184108,
          "mean" : 7886.575043,
          "stddev" : 2910.162906,
          "N" : 65536
        },
        "clat_ns" : {
          "min" : 1143168,
          "max" : 8241762,
          "mean" : 4130379.542542,
          "stddev" : 212223.240894,
          "N" : 65536,
          "percentile" : {
            "1.000000" : 4014080,
            "5.000000" : 4079616,
            "10.000000" : 4112384,
            "20.000000" : 4112384,
            "30.000000" : 4112384,
            "40.000000" : 4145152,
            "50.000000" : 4145152,
            "60.000000" : 4145152,
            "70.000000" : 4145152,
            "80.000000" : 4145152,
            "90.000000" : 4145152,
            "95.000000" : 4177920,
            "99.000000" : 4227072,
            "99.500000" : 4292608,
            "99.900000" : 7176192,
            "99.950000" : 7766016,
            "99.990000" : 8159232
          },
          "bins" : {
            "1138688" : 4,
            "1155072" : 28,
            "1171456" : 32,
            "1187840" : 18,
            "1204224" : 5,
            "1302528" : 3,
            "1318912" : 5,
            "1335296" : 1,
            "1351680" : 7,
            "1384448" : 1,
            "1531904" : 1,
            "1564672" : 2,
            "1581056" : 12,
            "1712128" : 1,
            "1728512" : 7,
            "1744896" : 6,
            "1761280" : 1,
            "1875968" : 1,
            "1908736" : 12,
            "1925120" : 2,
            "1941504" : 1,
            "2088960" : 1,
            "2113536" : 15,
            "2146304" : 1,
            "2277376" : 1,
            "2310144" : 14,
            "2408448" : 1,
            "2441216" : 15,
            "2473984" : 1,
            "2572288" : 9,
            "2637824" : 7,
            "2736128" : 8,
            "2801664" : 4,
            "2834432" : 5,
            "2932736" : 8,
            "2998272" : 7,
            "3096576" : 8,
            "3162112" : 5,
            "3194880" : 1,
            "3260416" : 9,
            "3358720" : 10,
            "3457024" : 7,
            "3522560" : 2,
            "3555328" : 6,
            "3653632" : 9,
            "3719168" : 5,
            "3784704" : 2,
            "3817472" : 6,
            "3850240" : 3,
            "3883008" : 12,
            "3915776" : 7,
            "3948544" : 19,
            "3981312" : 57,
            "4014080" : 272,
            "4046848" : 1116,
            "4079616" : 2666,
            "4112384" : 21051,
            "4145152" : 35756,
            "4177920" : 2308,
            "4227072" : 1563,
            "4292608" : 122,
            "4358144" : 27,
            "4423680" : 9,
            "4489216" : 2,
            "4554752" : 5,
            "4620288" : 1,
            "4685824" : 4,
            "4751360" : 4,
            "4816896" : 4,
            "4882432" : 4,
            "4947968" : 4,
            "5013504" : 4,
            "5079040" : 4,
            "5144576" : 4,
            "5210112" : 4,
            "5275648" : 4,
            "5341184" : 4,
            "5406720" : 4,
            "5472256" : 4,
            "5537792" : 4,
            "5603328" : 4,
            "5668864" : 5,
            "5734400" : 4,
            "5799936" : 5,
            "5865472" : 3,
            "5931008" : 3,
            "5996544" : 5,
            "6062080" : 4,
            "6127616" : 4,
            "6193152" : 5,
            "6258688" : 4,
            "6324224" : 7,
            "6389760" : 3,
            "6455296" : 5,
            "6520832" : 5,
            "6586368" : 1,
            "6651904" : 5,
            "6717440" : 2,
            "6782976" : 4,
            "6848512" : 4,
            "6914048" : 4,
            "6979584" : 4,
            "7045120" : 4,
            "7110656" : 4,
            "7176192" : 4,
            "7241728" : 4,
            "7307264" : 4,
            "7372800" : 4,
            "7438336" : 4,
            "7503872" : 4,
            "7569408" : 4,
            "7634944" : 4,
            "7700480" : 4,
            "7766016" : 4,
            "7831552" : 4,
            "7897088" : 4,
            "7962624" : 4,
            "8028160" : 4,
            "8093696" : 4,
            "8159232" : 5,
            "8224768" : 4
          }
        },
        "lat_ns" : {
          "min" : 1148302,
          "max" : 8250174,
          "mean" : 4138481.206497,
          "stddev" : 212320.100560,
          "N" : 65536
        },
        "bw_min" : 988832,
        "bw_max" : 990784,
        "bw_agg" : 100.000000,
        "bw_mean" : 989808.000000,
        "bw_dev" : 1380.272437,
        "bw_samples" : 2,
        "iops_min" : 61802,
        "iops_max" : 61924,
        "iops_mean" : 61863.000000,
        "iops_stddev" : 86.267027,
        "iops_samples" : 2
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1060,
      "usr_cpu" : 18.396226,
      "sys_cpu" : 50.094340,
      "ctx" : 17137,
      "majf" : 0,
      "minf" : 10,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.903870
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.998468,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.100000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.228882,
        "4" : 0.425720,
        "10" : 99.345398,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 256,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 54304,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 3,
      "write_ticks" : 222669,
      "in_queue" : 222671,
      "util" : 90.612245
    }
  ]
}

fio-3.28-4R5J0001-write-1G-256-1-16K: (groupid=0, jobs=1): err= 0: pid=84659: Mon Jun 23 21:38:53 2025
  write: IOPS=61.8k, BW=965MiB/s (1012MB/s)(1024MiB/1061msec); 0 zone resets
    slat (usec): min=2, max=184, avg= 7.89, stdev= 2.91
    clat (usec): min=1143, max=8241, avg=4130.38, stdev=212.22
     lat (usec): min=1148, max=8250, avg=4138.48, stdev=212.32
    clat percentiles (usec):
     |  1.00th=[ 4015],  5.00th=[ 4080], 10.00th=[ 4113], 20.00th=[ 4113],
     | 30.00th=[ 4113], 40.00th=[ 4146], 50.00th=[ 4146], 60.00th=[ 4146],
     | 70.00th=[ 4146], 80.00th=[ 4146], 90.00th=[ 4146], 95.00th=[ 4178],
     | 99.00th=[ 4228], 99.50th=[ 4293], 99.90th=[ 7177], 99.95th=[ 7767],
     | 99.99th=[ 8160]
   bw (  KiB/s): min=988832, max=990784, per=100.00%, avg=989808.00, stdev=1380.27, samples=2
   iops        : min=61802, max=61924, avg=61863.00, stdev=86.27, samples=2
  lat (msec)   : 2=0.23%, 4=0.43%, 10=99.35%
  cpu          : usr=18.40%, sys=50.09%, ctx=17137, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
  WRITE: bw=965MiB/s (1012MB/s), 965MiB/s-965MiB/s (1012MB/s-1012MB/s), io=1024MiB (1074MB), run=1061-1061msec

Disk stats (read/write):
  sda: ios=46/54304, merge=0/0, ticks=3/222669, in_queue=222671, util=90.61%